# SQL

---

SQL is a standard language for ***storing, manipulating and retrieving data*** in databases.

SQL=Structured Query Language

###RELATIONAL DATABASE

A relational database is a ***collection of information*** that organizes data in predefined relationships where data is ***stored in one or more tables*** (or "relations") of columns and rows, making it easy to see and understand how different data structures relate to each other.

###DBMS

DBMS stands for Database Management System, and RDBMS is the acronym for the Relational Database Management system. <b><i>In DBMS, the data is stored as a file, whereas in RDBMS, data is stored in the form of tables.</i></b>

###ADVANTAGES OF RDBMS

***1.Ease of Use***

This is one of the biggest advantages of a relational database; RDBMS has a user-friendly table format, with data being organized according to a natural structure. This also makes it easy to access, and manipulate, and it’s easy to locate entries that match.

***2.Network Access***

A software program in the RDBMS is designed specially to catch requests sent over a network, facilitating client-database communication. Users need not log in for accessing or using the database, affording them greater convenience.

This feature also makes it possible for developers to build web apps and desktop tools that make database interaction possible.

***3.Language***

RDBMS supports SQL, a standard and familiar language; it has a simple syntax, and uses English phrases and keywords, making it easy to learn and understand. RDBMS also has the capability to insert non-SQL database-centric keywords, features, and functions.

***4.Performance***

RDBMS is not intrinsically a fast-performing database, but with the database design, there are several optimizations embedded into it, which actually enhances performance. This eventually translates into fast performance for all data sets and apps.

***5.Maintenance***

It is easier to maintain RDBMS as the tech support team or database administrators can control, test, maintain, and perform backup for the databases they have within their main system. The functions are automated via inbuilt automation tools on the operating system in the RDBMS.

***6.Multi-Person Access***

We have already seen that multiple users can access the database at the same time. During data change or updating, users can leverage the inbuilt functionality of transaction management and locking for data access.

This way, the system is protected from crashing due to multiple users working on the data, and users are not allowed to partially modify data.

***7.Prevents Data Redundancy***

This is one of the most important RDBMS advantages. Data redundancy is prevented as tables with specific data have relations among themselves, and the necessary data is retrieved from prior tables.

***8.Privileges and Data Security***

Access to the database is controlled and subject to authentication by the database admin, who has the power to grant or reject access to users. This increases the security of the database.

An RDBMS has features for privilege control and authorization, which means that the admin can reject database access requests as we saw earlier. Permissions are granted after verifying the specific database activities the users intend to carry out. The IP address of the remote client is also considered, and in combination with user authorization, it controls the access to selected systems.

###DISADVANTAGES OF RDBMS###

***1.Cost***

Setting up and maintaining a database is a pretty expensive affair, and hence, is one of the biggest disadvantages of an RDBMS.

The specific software needed to create and configure a relational database costs a pretty packet. Updating all the information to get the program up and running can also be difficult, and especially so if your organization is a large one with a complex database.

In such cases, getting help externally from experienced programmers may become necessary, to build an RDBMS by implementing SQL. You will also need to have an expert RDBMS administrator for managing and controlling the database.

***2.Lack of Speed***

Compared to other types of databases, RDBMS extracts results pretty slowly, and therefore, performance is much slower. However, it is not among the biggest disadvantages of RDBMS, as its ease of use and rich functionality trump the speed factor.

***3.Memory Space***

As an RDBMS stores data in tables that have rows and columns, it occupies a great deal of physical memory. This also means additional cost to have more memory and is a significant drawback.

###SQL KEYWORDS

***1.ADD***

The ADD command is used to **add a column** in an existing table.

In [ ]:
ALTER TABLE Customers
ADD Email varchar(255);



---

***2.ADD CONSTRAINT***

The ADD CONSTRAINT command is used to **create a constraint after a table is already created.**

In [ ]:
ALTER TABLE Persons
ADD CONSTRAINT PK_Person PRIMARY KEY (ID,LastName);



---

***3.ALL***

The ALL command **returns true** if all of the subquery values meet the condition.

In [ ]:
SELECT ProductName
FROM Products
WHERE ProductID = ALL (SELECT ProductID FROM OrderDetails WHERE Quantity = 10);



---

***4.ALTER TABLE***

The ALTER TABLE command **adds, deletes, or modifies columns in a table.**

The ALTER TABLE command also **adds and deletes various constraints in a table.**

In [ ]:
ALTER TABLE Customers
ADD Email varchar(255);



---

***5.ALTER COLUMN***

The ALTER COLUMN command is used to **change the data type of a column in a table.**

In [ ]:
ALTER TABLE Employees
ALTER COLUMN BirthDate year;



---

***6.ALTER TABLE***

The ALTER TABLE command **adds, deletes, or modifies columns in a table.**

The ALTER TABLE command also **adds and deletes various constraints in a table.**

In [ ]:
ALTER TABLE Customers
DROP COLUMN Email;



---

***7.AND***

The AND command is used with **WHERE to only include rows where both conditions is true**

In [ ]:
SELECT * FROM Customers
WHERE Country='Germany' AND City='Berlin';



---

***8.ANY***

The ANY command **returns true if any of the subquery values meet the condition.**

In [ ]:
SELECT ProductName
FROM Products
WHERE ProductID = ANY (SELECT ProductID FROM OrderDetails WHERE Quantity = 10);



---

***9.AS***

The AS command is used to **rename a column or table with an alias.**

An alias **only exists for the duration of the query.**

In [ ]:
SELECT CustomerID AS ID, CustomerName AS Customer
FROM Customers;



---

***10.ASC***

The ASC command is used to **sort the data returned in ascending order.**

In [ ]:
SELECT * FROM Customers
ORDER BY CustomerName ASC;



---

***11.BETWEEN***

The BETWEEN command is used to **select values within a given range**. The values can be numbers, text, or dates.

The BETWEEN command is inclusive: **begin and end values are included.**

In [ ]:
SELECT * FROM Products
WHERE Price BETWEEN 10 AND 20;



---

***12.CASE***

The CASE command is used is to **create different output based on conditions.**

In [ ]:
SELECT OrderID, Quantity,
CASE
    WHEN Quantity > 30 THEN 'The quantity is greater than 30'
    WHEN Quantity = 30 THEN 'The quantity is 30'
    ELSE 'The quantity is under 30'
END
FROM OrderDetails;



---

***13.DROP CONSTRAINT***

The DROP CONSTRAINT command is used to **delete a UNIQUE, PRIMARY KEY, FOREIGN KEY, or CHECK constraint.**

In [ ]:
ALTER TABLE Persons
DROP CONSTRAINT UC_Person;



---

***14.CREATE DATABASE***

The CREATE DATABASE command is used is to **create a new SQL database.**

In [ ]:
CREATE DATABASE testDB;



---

***15.CREATE TABLE***

The CREATE TABLE command **creates a new table** in the database.

In [ ]:
CREATE TABLE Persons (
    PersonID int,
    LastName varchar(255),
    FirstName varchar(255),
    Address varchar(255),
    City varchar(255)
);



---

***16.CREATE TABLE Using Another Table***

In [ ]:
CREATE TABLE TestTable AS
SELECT customername, contactname
FROM customers;



---

***17.CREATE PROCEDURE***

The CREATE PROCEDURE command is used to **create a stored procedure.**

A stored procedure is a **prepared SQL code that you can save, so the code can be reused over and over again.**

In [ ]:
CREATE PROCEDURE SelectAllCustomers
AS
SELECT * FROM Customers
GO;

EXEC SelectAllCustomers;



---

***18.CREATE INDEX***

The CREATE INDEX command is used to **create indexes in tables (allows duplicate values).**

Indexes are used to **retrieve data from the database very fast.** The users cannot see the indexes, they are just used to speed up searches/queries.

In [ ]:
CREATE INDEX idx_lastname
ON Persons (LastName);



---

***19.DROP DATABASE***

The DROP DATABASE command is used is to **delete an existing SQL database.**

In [ ]:
DROP DATABASE testDB;



---

***20.DEFAULT***

The DEFAULT constraint provides a **default value for a column.**

The default value will be added to all new records if no other value is specified.

In [ ]:
CREATE TABLE Persons (
    City varchar(255) DEFAULT 'Sandnes'
);



---

***21.DELETE***

The DELETE command is used to **delete existing records** in a table.

In [ ]:
DELETE FROM Customers WHERE CustomerName='Alfreds Futterkiste';



---

***22.DESC***

The DESC command is used to sort the data returned in **descending order.**

In [ ]:
SELECT * FROM Customers
ORDER BY CustomerName DESC;



---

***23.SELECT DISTINCT***

The SELECT DISTINCT command returns **only distinct (different) values in the result set.**

In [ ]:
SELECT DISTINCT Country FROM Customers;



---

***24.DROP COLUMN***

The DROP COLUMN command is used to **delete a column in an existing table.**

In [ ]:
ALTER TABLE Customers
DROP COLUMN ContactName;



---

***25.DROP TABLE***

The DROP TABLE command **deletes a table in the database.**

In [ ]:
DROP TABLE Shippers;



---

***26.DROP INDEX***

The DROP INDEX command is used to **delete an index in a table.**

In [ ]:
DROP INDEX index_name ON table_name;



---

###DDL###

DDL – ***Data Definition Language***

Data Definition Language actually consists of the SQL commands that can be used ***to define the database schema.*** It simply deals with descriptions of the database schema and is used to create and modify the structure of database objects in the database.

***1.CREATE:*** This command is used to create the database or its objects (like table, index, function, views, store procedure, and triggers).

***2.DROP:*** This command is used to delete objects from the database.

***3.ALTER:*** This is used to alter the structure of the database.

***4.TRUNCATE:*** This is used to remove all records from a table, including all spaces allocated for the records are removed.

***5.COMMENT:*** This is used to add comments to the data dictionary.

***6.RENAME:*** This is used to rename an object existing in the database.

***1.CREATE***

A Table is a combination of rows and columns. For creating a table we have to define the structure of a table by adding names to columns and providing data type and size of data to be stored in columns.

Syntax: `CREATE table table_name`

In [ ]:
CREATE TABLE Customer(
    CustomerID INT PRIMARY KEY,
    CustomerName VARCHAR(50),
    LastName VARCHAR(50),
    Country VARCHAR(50),
    Age int(2),
  Phone int(10)
);



---

***2.DROP***

DROP is used to ***delete a whole database or just a table.***

Syntax: `DROP object object_name ;`

Syntax: `DROP DATABASE database_name;`



---

***3.TRUNCATE***

The major difference between TRUNCATE and DROP is that truncate is used to ***delete the data inside the table not the whole table.***

Syntax: `TRUNCATE TABLE  table_name;`



---

***4.ALTER***

The ALTER TABLE ***command adds, deletes, or modifies columns in a table.***

The ALTER TABLE command also ***adds and deletes various constraints in a table.***

In [ ]:
ALTER TABLE Customers
ADD Email varchar(255);



---

###DML###

 DML-Data Manipulation Language

 The SQL commands that deal with the manipulation of data present in the database belong to DML or Data Manipulation Language and this includes most of the SQL statements. It is the component of the SQL statement that controls access to data and to the database. Basically, DCL statements are grouped with DML statements.

List of DML commands:

***1.INSERT:*** It is used to insert data into a table.

***2.UPDATE:*** It is used to update existing data within a table.

***3.DELETE:*** It is used to delete records from a database table.

***4.LOCK:*** Table control concurrency.

***5.CALL:*** Call a PL/SQL or JAVA subprogram.

***6.EXPLAIN PLAN:*** It describes the access path to data.

***1.INSERT***

The INSERT INTO statement of SQL is used to ***insert a new row/record in a table.*** There are two ways of using the SQL INSERT INTO statement for inserting rows.

In [ ]:
INSERT INTO table_name VALUES (value1, value2, value3);

table_name: name of the table. value1, value2



---

***2.UPDATE***

The UPDATE statement in SQL is used to update the data of an existing table in the database. We can update single columns as well as multiple columns using the UPDATE statement as per our requirement.

In a very simple way, we can say that SQL commands(UPDATE and DELETE) are used to change the data that is already in the database. The SQL DELETE command uses a WHERE clause.

Syntax: `UPDATE table_name SET column1 = value1, column2 = value2,… `

***UPDATE:*** Command is used to update the column value in the table.

***WHERE:*** Specifies the condition which we want to implement on the table.

Syntax: `WHERE condition;
table_name: name of the table
column1: name of first , second, third column….
value1: new value for first, second, third column….
condition: condition to select the rows for which the
values of columns needs to be updated.`



---

***3.DELETE***

SQL DELETE is a basic SQL operation used to ***delete data in a database.*** SQL DELETE is an important part of database management DELETE can be used to selectively remove records from a database table based on certain conditions. This SQL DELETE operation is important for database size management, data accuracy, and integrity.

Syntax: `DELETE FROM table_name
WHERE some_condition;`

In [ ]:
DELETE FROM GFG_Employees
WHERE department = 'Development';



---

***DTL***

DTL-Data Transaction Language

***1.SAVEPOINT***

SAVEPOINT ***creates points within the groups of transactions in which to ROLLBACK.***

A SAVEPOINT is a point in a transaction in which you can roll the transaction back to a certain point without rolling back the entire transaction.

Syntax: `SAVEPOINT SAVEPOINT_NAME;`

In [ ]:
SAVEPOINT SP1;
//Savepoint created.
DELETE FROM Student WHERE AGE = 20;
//deleted
SAVEPOINT SP2;
//Savepoint created.



---

***2.ROLLBACK***

If any error occurs with any of the SQL grouped statements, ***all changes need to be aborted.*** The process of reversing changes is called rollback. This command can only be used to undo transactions since the last COMMIT or ROLLBACK command was issued.

Syntax: `ROLLBACK;`

In [ ]:
DELETE FROM Student WHERE AGE = 20;
ROLLBACK;



---

***3.COMMIT***

COMMIT in SQL is a transaction control language that is used to ***permanently save the changes done in the transaction in tables/databases.*** The database cannot regain its previous state after its execution of commit.

In [ ]:
sql>
SELECT *
FROM Staff
WHERE Allowance = 400;

sql> COMMIT;



---

###AGGREGATE FUNCTIONS###

1.COUNT

2.SUM

3.AVERAGE

4.MIN

5.MAX

***1.COUNT***

The COUNT() function returns the ***number of rows*** that matches a specified criterion.

Syntax: `SELECT COUNT(column_name)
FROM table_name
WHERE condition;`

In [ ]:
SELECT COUNT(*)
FROM Products;



---

***2.SUM***

The SUM() function returns ***the total sum of a numeric column.***

Syntax: `SELECT SUM(column_name)
FROM table_name
WHERE condition;`

In [ ]:
SELECT SUM(Quantity)
FROM OrderDetails;



---

***3.AVERAGE***

The AVG() function returns the ***average value of a numeric column.***

Syntax: `SELECT AVG(column_name)
FROM table_name
WHERE condition;`

In [ ]:
SELECT AVG(Price)
FROM Products;



---

***4.MIN***

The MIN() function returns the ***smallest value of the selected column.***

Syntax:`SELECT MIN(column_name)
FROM table_name
WHERE condition;`

In [ ]:
SELECT MIN(Price)
FROM Products;



---

***5.MAX***

The MAX() function returns the ***largest value of the selected column.***

Syntax:`SELECT MAX(column_name)
FROM table_name
WHERE condition;`

In [ ]:
SELECT MAX(Price)
FROM Products;



---

###DATA CONSTRAINTS###

Constraints are used to ***limit the type of data that can go into a table.*** This ensures the accuracy and reliability of the data in the table. If there is any violation between the constraint and the data action, the action is aborted.

Constraints can be ***column level or table level.*** Column level constraints apply to a column, and table level constraints apply to the whole table.

***NOT NULL*** - Ensures that a column cannot have a NULL value

***UNIQUE*** - Ensures that all values in a column are different

***PRIMARY KEY*** - A combination of a NOT NULL and UNIQUE. Uniquely identifies each row in a table

***FOREIGN KEY*** - Prevents actions that would destroy links between tables

***CHECK*** - Ensures that the values in a column satisfies a specific condition

***DEFAULT*** - Sets a default value for a column if no value is specified

***CREATE INDEX*** - Used to create and retrieve data from the database very quickly

***1.NOT NULL***

The NOT NULL constraint ***enforces a column to NOT accept NULL values.***

This enforces a field to always contain a value, which means that you cannot insert a new record, or update a record without adding a value to this field.

In [ ]:
CREATE TABLE Persons (
    ID int NOT NULL,
    LastName varchar(255) NOT NULL,
    FirstName varchar(255) NOT NULL,
    Age int
);



---

***2.UNIQUE***

The UNIQUE constraint ensures that ***all values in a column are different.***

Both the UNIQUE and PRIMARY KEY constraints provide a guarantee for ***uniqueness for a column or set of columns.***

A PRIMARY KEY constraint automatically has a UNIQUE constraint.

However, you can have many UNIQUE constraints per table, but only one PRIMARY KEY constraint per table.

In [ ]:
CREATE TABLE Persons (
    ID int NOT NULL UNIQUE,
    LastName varchar(255) NOT NULL,
    FirstName varchar(255),
    Age int
);



---

***3.PRIMARY KEY***

The PRIMARY KEY constraint ***uniquely identifies each record in a table.***

Primary keys must contain UNIQUE values, and cannot contain NULL values.

***A table can have only ONE primary key; and in the table, this primary key can consist of single or multiple columns (fields).***

In [ ]:
CREATE TABLE Persons (
    ID int NOT NULL,
    LastName varchar(255) NOT NULL,
    FirstName varchar(255),
    Age int,
    PRIMARY KEY (ID)
);



---

***4.FOREIGN KEY***

The FOREIGN KEY constraint is used to ***prevent actions that would destroy links between tables.***

***A FOREIGN KEY is a field (or collection of fields) in one table, that refers to the PRIMARY KEY in another table.***

The table with the foreign key is called the child table, and the table with the primary key is called the referenced or parent table.

In [ ]:
CREATE TABLE Orders (
    OrderID int NOT NULL,
    OrderNumber int NOT NULL,
    PersonID int,
    PRIMARY KEY (OrderID),
    FOREIGN KEY (PersonID) REFERENCES Persons(PersonID)
);



---

***5.CHECK***

The CHECK constraint is used to ***limit the value range that can be placed in a column.***

If you define a CHECK constraint on a column it will ***allow only certain values for this column.***

If you define a CHECK constraint on a table it can limit the values in certain columns based on values in other columns in the row.

In [ ]:
CREATE TABLE Persons (
    ID int NOT NULL,
    LastName varchar(255) NOT NULL,
    FirstName varchar(255),
    Age int,
    CHECK (Age>=18)
);

###JOIN###

A JOIN clause is used to ***combine rows from two or more tables***, based on a related column between them.

Here are the different types of the JOINs in SQL:

***(INNER) JOIN:*** Returns records that have matching values in both tables

***LEFT (OUTER) JOIN:*** Returns all records from the left table, and the matched records from the right table

***RIGHT (OUTER) JOIN:*** Returns all records from the right table, and the matched records from the left table

***FULL (OUTER) JOIN:*** Returns all records when there is a match in either left or right table

***1.INNER JOIN***

The INNER JOIN keyword selects records that have ***matching values in both tables.***

Syntax: `SELECT column_name(s)
FROM table1
INNER JOIN table2
ON table1.column_name = table2.column_name;`

In [ ]:
SELECT Orders.OrderID, Customers.CustomerName
FROM Orders
INNER JOIN Customers ON Orders.CustomerID = Customers.CustomerID;



---

***2.LEFT JOIN***

The LEFT JOIN keyword ***returns all records from the left table (table1), and the matching records from the right table (table2).*** The result is 0 records from the right side, if there is no match.

Syntax: `SELECT column_name(s)
FROM table1
LEFT JOIN table2
ON table1.column_name = table2.column_name;`

In [ ]:
SELECT Customers.CustomerName, Orders.OrderID
FROM Customers
LEFT JOIN Orders ON Customers.CustomerID = Orders.CustomerID
ORDER BY Customers.CustomerName;



---

***3.RIGHT JOIN***

The RIGHT JOIN keyword ***returns all records from the right table (table2), and the matching records from the left table (table1).*** The result is 0 records from the left side, if there is no match.

Syntax:`SELECT column_name(s)
FROM table1
RIGHT JOIN table2
ON table1.column_name = table2.column_name;`

In [ ]:
SELECT Orders.OrderID, Employees.LastName, Employees.FirstName
FROM Orders
RIGHT JOIN Employees ON Orders.EmployeeID = Employees.EmployeeID
ORDER BY Orders.OrderID;



---

***4.FULL JOIN***

The FULL OUTER JOIN keyword ***returns all records when there is a match in left (table1) or right (table2) table records.***

Tip: FULL OUTER JOIN and FULL JOIN are the same.

Syntax:`SELECT column_name(s)
FROM table1
FULL OUTER JOIN table2
ON table1.column_name = table2.column_name
WHERE condition;`

In [ ]:
SELECT Customers.CustomerName, Orders.OrderID
FROM Customers
FULL OUTER JOIN Orders ON Customers.CustomerID=Orders.CustomerID
ORDER BY Customers.CustomerName;



---

***5.SELF JOIN***

A self join is a ***regular join, but the table is joined with itself.***

Syntax:`SELECT column_name(s)
FROM table1 T1, table1 T2
WHERE condition;`

In [ ]:
SELECT A.CustomerName AS CustomerName1, B.CustomerName AS CustomerName2, A.City
FROM Customers A, Customers B
WHERE A.CustomerID <> B.CustomerID
AND A.City = B.City
ORDER BY A.City;



---

###STRING FUNCTIONS###

***1.CONCAT():*** This function is used to ***add two words or strings.***

Syntax: `SELECT 'Geeks' || ' ' || 'forGeeks' FROM dual;`

Output: ‘GeeksforGeeks’

***2.LENGTH():*** This function is used to find the ***length of a word.**

Syntax: `LENGTH('GeeksForGeeks');`

Output: 13

***3.SUBSTR():*** This function is used to ***find a sub string from the a string from the given position.***

Syntax:`SUBSTR('geeksforgeeks', 1, 5);`

Output: ‘geeks’

***4.REPLACE():*** This function is used to cut the given string by ***removing the given sub string.***

Syntax: `REPLACE('123geeks123', '123');`

Output: geeks

***5.UCASE():*** This function is used to make the string in ***upper case.***

Syntax: `UCASE ("GeeksForGeeks");`

Output:
GEEKSFORGEEKS

***6.LOWER():*** This function is used to convert the upper case string into lower case.

Syntax: `SELECT LOWER('GEEKSFORGEEKS.ORG');`

Output: geeksforgeeks.org



---

###NUMERIC FUNCTIONS###


***1.ABS():*** It returns the ***absolute value of a number.***

Syntax: `SELECT ABS(-243.5);`

Output: 243.5

***2.FLOOR():*** It returns the largest integer value that is less than or equal to a number.

Syntax: `SELECT FLOOR(25.75);`

Output: 25

***3.MOD():*** It returns the ***remainder*** (aka. modulus) of n divided by m.

Syntax: `SELECT MOD(18, 4);`

Output: 2

***4.ROUND(): It returns a number *** rounded to a certain number of decimal places.***

Syntax: `SELECT ROUND(5.553);`

Output: 6

***5.CEILING():*** It returns the ***smallest integer value*** that is greater than or equal to a number.

Syntax: `SELECT CEILING(25.75);`

Output: 26



---

###VIEWS###


***A view contains rows and columns, just like a real table.*** The fields in a view are fields from one or more real tables in the database.

You can add SQL statements and functions to a view and present the data as if the data were coming from one single table.

A view is created with the CREATE VIEW statement.

Syntax: `CREATE VIEW view_name AS
SELECT column1, column2, ...
FROM table_name
WHERE condition;`

In [ ]:
CREATE VIEW [Brazil Customers] AS
SELECT CustomerName, ContactName
FROM Customers
WHERE Country = 'Brazil';



---

###DATE AND TIME###

***1.DATE***

The DATE() function ***extracts the date part from a datetime expression.***

Syntax:`DATE(expression)`

Example: `SELECT DATE("2017-06-15 09:34:21");`

Output: 2017-06-15

***2.TIME***

The TIME() function ***extracts the time part from a given time/datetime.***

Note: This function returns "00:00:00" if expression is not a datetime/time, or NULL if expression is NULL.

Syntax:`TIME(expression)`

Example: `SELECT TIME("2017-08-15 19:30:10");`

Output: 19:30:10

***3.DATE_ADD***

The DATE_ADD() function ***adds a time/date interval to a date and then returns the date.***

Syntax: `DATE_ADD(date, INTERVAL value addunit)`

Example: `SELECT DATE_ADD("2017-06-15", INTERVAL 10 DAY);`

Output: 2017-06-25

***4.TIMESTAMP***

The TIMESTAMP() function ***returns a datetime value based on a date or datetime value.***

Note: If there are specified two arguments with this function, it first adds the second argument to the first, and then returns a datetime value.

Syntax:`TIMESTAMP(expression, time)`

Example: `SELECT TIMESTAMP("2017-07-23",  "13:10:11");`

Output: 2017-07-23 13:10:11



---

###GROUP BY###

The GROUP BY statement groups rows that have the ***same values into summary rows, like "find the number of customers in each country".***

The GROUP BY statement is often used with aggregate functions (COUNT(), MAX(), MIN(), SUM(), AVG()) to group the result-set by one or more columns.

Syntax: `SELECT column_name(s)
FROM table_name
WHERE condition
GROUP BY column_name(s)
ORDER BY column_name(s);`

In [ ]:
SELECT COUNT(CustomerID), Country
FROM Customers
GROUP BY Country
ORDER BY COUNT(CustomerID) DESC;



---

###HAVING###

The HAVING clause was added to SQL because the ***WHERE keyword cannot be used with aggregate functions.***

Syntax: `SELECT column_name(s)
FROM table_name
WHERE condition
GROUP BY column_name(s)
HAVING condition
ORDER BY column_name(s);`

In [ ]:
SELECT COUNT(CustomerID), Country
FROM Customers
GROUP BY Country
HAVING COUNT(CustomerID) > 5
ORDER BY COUNT(CustomerID) DESC;



---

###PIVOT AND UNPIVOT###

In SQL, Pivot and Unpivot are relational operators that are used to ***transform one table into another in order to achieve more simpler view of table.***

 Conventionally we can say that Pivot operator converts the rows data of the table into the column data. The Unpivot operator does the opposite that is it transform the column based data into rows.

 ***PIVOT***

 Syntax: `SELECT (ColumnNames)
FROM (TableName)
PIVOT
 (
   AggregateFunction(ColumnToBeAggregated)
   FOR PivotColumn IN (PivotColumnValues)
 ) AS (Alias) //Alias is a temporary name for a table`

 ***UNPIVOT***

 Syntax: `SELECT (ColumnNames)
FROM (TableName)
UNPIVOT
 (
   AggregateFunction(ColumnToBeAggregated)
   FOR PivotColumn IN (PivotColumnValues)
 ) AS (Alias)`



---

###DYNAMIC SQL###

Dynamic SQL is a programming technique that could be ***used to write SQL queries during runtime.*** Dynamic SQL could be used to create general and flexible SQL queries.

Syntax: `'SELECT statement';`

To run a dynamic SQL statement, run the stored procedure sp_executesql as shown below :

`EXEC sp_executesql N'SELECT statement';`



---

###RECURSIVE QUERY###

A recursive query is one that is defined by a ***Union All with an initialization fullselect that seeds the recursion.*** The iterative fullselect contains a direct reference to itself in the FROM clause. There are additional restrictions as to what can be specified in the definition of a recursive query.